/*===========================================================================
** Header controller - change meta tags for dream virgin page and landing page
*===========================================================================*/
(function(angular){
	'use strict';
	angular.module('dreamvController', [])
	.controller('DreamvController', ['$scope', 'Head', function($scope, Head) {
		var meta = ['בתולת החלומות - ספר על חלומות צלולים',
					'בתולת החלומות הינו פרויקט מיוחד, ספר קצר שנועד להעביר את הידע בתחום החלומות דרך קלט רגשי. מסופר על בחורה צעירה שמחפשת דירה בתל אביב, אבל מסתבר ששותפתה העתידית חולמת לה עתיד משלה.',
					'בתולת החלומות, פרויקט מיוחד, ספר קצר, תחום החלומות, קלט רגשי, חלומות צלולים, חלום צלול, חלימה מודעת, שיתוק שינה.'
					];
		Head.setHead(meta[0], meta[1], meta[2]);
	}]);
})(angular);